Infineon/micropython-psoc-edge/ports/psoc-edge/machine_pdm_pcm.c
/*
 * This file is part of the MicroPython project, http://micropython.org/
 *
 * The MIT License (MIT)
 *
 * Copyright (c) 2026 Infineon Technologies AG
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#include <stdlib.h>
#include <math.h>
#include "cy_pdl.h"
#include "cybsp.h"

#include "sys_int.h"

#include "extmod/vfs.h"
#include "py/stream.h"
#include "py/runtime.h"


#define pdm_pcm_assert_raise_val(msg, ret)   if (ret != CY_PDM_PCM_SUCCESS) { \
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT(msg), ret); \
}

/* -------------------------------- Rx FIFO Ping-Pong Buffer -------------------------------- */

/**
 * Number of FIFO frames that will be stored
 * in each half of the ping-pong buffer.
 */
#define NUM_OF_RX_HW_FIFO_FRAMES_IN_RX_BUFFER         16
#define NUM_OF_RX_HW_FIFO_FRAMES_IN_HALF_RX_BUFFER    (NUM_OF_RX_HW_FIFO_FRAMES_IN_RX_BUFFER / 2)

/**
 * The PDM PCM peripheral has hardware FIFO capable
 * of up to 64 samples.
 * The IRQ trigger level is set to half of the FIFO size.
 * That way we can process the samples when the FIFO is
 * half full, ensuring that we read the samples before the
 * FIFO is full and we lose data.
 * Each half size FIFO read will compose a frame that will
 * be added to the ping-pong buffer.
 * As each sample is considered to be 8 bytes,
 * a frame match the actual size of the hardware FIFO for
 * a mono channel, or 2 halves FIFO for stereo.
 */
#define MAX_SAMPLES_RX_HW_FIFO                 64
#define NUM_OF_SAMPLES_IN_RX_HW_FIFO_FRAME     32
#define NUM_OF_WORDS_IN_RX_HW_FIFO_FRAME       (NUM_OF_SAMPLES_IN_RX_HW_FIFO_FRAME * 2)
#define RX_HW_FIFO_IRQ_TRIGGER_LEVEL           (NUM_OF_SAMPLES_IN_RX_HW_FIFO_FRAME)

/**
 * A ping-pong buffer implementation will store the samples read
 * from the PDM PCM hardware FIFO.
 *
 * Each sample will contain up to 8 bytes of data, being able
 * to store up to 32-bit stereo samples.
 * As the buffer is a uint32_t array, each sample will take
 * 2 positions in the buffer.
 * In case of mono audio, the odd positions will be empty.
 *
 * The buffer is split into two halves.
 * The active half will be the one used in the IRQ handler to
 * store the incoming samples from the FIFO.
 * The processing half will be used to copy the samples
 * into the ring buffer.
 *
 * The ring buffer will be used to transfer the data stream
 * into the application provided buffer.
 */
#define SIZEOF_RX_BUFFER_IN_SAMPLES            (NUM_OF_RX_HW_FIFO_FRAMES_IN_RX_BUFFER * NUM_OF_SAMPLES_IN_RX_HW_FIFO_FRAME)
#define SIZEOF_RX_BUFFER_IN_WORDS              (SIZEOF_RX_BUFFER_IN_SAMPLES * 2)
#define SIZEOF_HALF_RX_BUFFER_IN_SAMPLES       (SIZEOF_RX_BUFFER_IN_SAMPLES / 2)
#define SIZEOF_HALF_RX_BUFFER_IN_WORDS         (SIZEOF_HALF_RX_BUFFER_IN_SAMPLES * 2)

#define SIZEOF_PDM_PCM_SAMPLE_IN_BYTES          8

typedef struct _pcm_pdm_rx_fifo_ping_pong_buffer_t {
    uint32_t rx_fifo_buffer[SIZEOF_RX_BUFFER_IN_WORDS];
    uint32_t *active_half_rx_fifo_buf_ptr;
    uint32_t *processing_half_rx_fifo_buf_ptr;
    volatile uint8_t rx_hw_fifo_frame_count;
} pcm_pdm_rx_fifo_ping_pong_buffer_t;

static void pdm_pcm_rx_buffer_init(pcm_pdm_rx_fifo_ping_pong_buffer_t *self) {
    memset(self->rx_fifo_buffer, 0, sizeof(self->rx_fifo_buffer));
    self->active_half_rx_fifo_buf_ptr = self->rx_fifo_buffer;
    self->processing_half_rx_fifo_buf_ptr = &self->rx_fifo_buffer[SIZEOF_HALF_RX_BUFFER_IN_WORDS];
    self->rx_hw_fifo_frame_count = 0;
}

static inline bool pdm_pcm_rx_buffer_is_half_full(pcm_pdm_rx_fifo_ping_pong_buffer_t *self) {
    return self->rx_hw_fifo_frame_count == 0;
}

static void _pdm_pcm_rx_buffer_update_hw_fifo_frame_counter(pcm_pdm_rx_fifo_ping_pong_buffer_t *self) {
    self->rx_hw_fifo_frame_count++;
    if (self->rx_hw_fifo_frame_count == NUM_OF_RX_HW_FIFO_FRAMES_IN_HALF_RX_BUFFER) {
        self->rx_hw_fifo_frame_count = 0;
    }
}

static void _pdm_pcm_rx_buffer_swap_halves(pcm_pdm_rx_fifo_ping_pong_buffer_t *self) {
    if (pdm_pcm_rx_buffer_is_half_full(self)) {
        uint32_t *temp = self->active_half_rx_fifo_buf_ptr;
        self->active_half_rx_fifo_buf_ptr = self->processing_half_rx_fifo_buf_ptr;
        self->processing_half_rx_fifo_buf_ptr = temp;
    }
}

static inline uint32_t *pdm_pcm_rx_buffer_get_next_frame_to_fill(pcm_pdm_rx_fifo_ping_pong_buffer_t *self) {
    uint32_t *next_writable_frame_segment = &self->active_half_rx_fifo_buf_ptr[NUM_OF_WORDS_IN_RX_HW_FIFO_FRAME * self->rx_hw_fifo_frame_count];
    _pdm_pcm_rx_buffer_update_hw_fifo_frame_counter(self);
    _pdm_pcm_rx_buffer_swap_halves(self);
    return next_writable_frame_segment;
}

/* -------------------------------- PDM Block -------------------------------- */

typedef struct _pdm_pcm_block_obj_t {
    uint8_t id;
    PDM_Type *periph;
    bool inited;
} pdm_pcm_block_obj_t;

/**
 * For the current PSE8x family there is only one PDM block.
 */
static pdm_pcm_block_obj_t pdm_pcm_block_obj[1] = { { 0, PDM0, false } };

static void pdm_pcm_block_init(pdm_pcm_block_obj_t *block) {

    /**
     * TODO: Refactor based on pclk_div.
     * Before doing this we need to ensure pclk_div not only resolve the required divider type, but also
     * provide any available if the required is not available.
     * In this case, only the 16.5 bit fractional divider is available for PDM PCM.
     *
     * For now this is moved from the BSP cfg, to start init ownership in each machine peripheral, not
     * as part of the BSP init.
     * {
     */
    #if defined(CY_DEVICE_CONFIGURATOR_IP_ENABLE_FEATURE)
    Cy_SysClk_PeriGroupSlaveInit(CY_MMIO_PDM0_PERI_NR, CY_MMIO_PDM0_GROUP_NR, CY_MMIO_PDM0_SLAVE_NR, CY_MMIO_PDM0_CLK_HF_NR);
    #endif /* defined (CY_DEVICE_CONFIGURATOR_IP_ENABLE_FEATURE) */

