Infineon/micropython-psoc-edge/ports/psoc-edge/machine_pdm_pcm.c
    Cy_SysClk_PeriPclkAssignDivider(PCLK_PDM0_CLK_IF_SRSS, CY_SYSCLK_DIV_16_5_BIT, 1U);
    Cy_SysClk_PeriPclkDisableDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 1U);
    Cy_SysClk_PeriPclkSetFracDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 1U, 3U, 0U);
    Cy_SysClk_PeriPclkEnableDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 1U);
    /* } */

    cy_stc_pdm_pcm_config_v2_t pdm_pcm_block_conf = {
        .clkDiv = 7,
        .clksel = CY_PDM_PCM_SEL_SRSS_CLOCK,
        .halverate = CY_PDM_PCM_RATE_FULL,
        .route = 4,
        .fir0_coeff_user_value = false,
        .fir1_coeff_user_value = false,
    };

    cy_en_pdm_pcm_status_t ret = Cy_PDM_PCM_Init(block->periph, &pdm_pcm_block_conf);
    pdm_pcm_assert_raise_val("PDM PCM initialization failed with code: %d \r\n", ret);
    block->inited = true;
}

static inline bool pdm_pcm_block_is_inited(pdm_pcm_block_obj_t *block) {
    return block->inited;
}

static inline void pdm_pcm_block_deinit(pdm_pcm_block_obj_t *block) {
    Cy_PDM_PCM_DeInit(block->periph);
    /**
     * TODO: Refactor based on pclk_div.
     * {
     */
    Cy_SysClk_PeriPclkDisableDivider((en_clk_dst_t)CYBSP_PDM_CLK_DIV_GRP_NUM, CY_SYSCLK_DIV_16_5_BIT, 1U);
    #if defined(CY_DEVICE_CONFIGURATOR_IP_ENABLE_FEATURE)
    Cy_SysClk_PeriGroupSlaveDeinit(CY_MMIO_PDM0_PERI_NR, CY_MMIO_PDM0_GROUP_NR, CY_MMIO_PDM0_SLAVE_NR);
    #endif /* defined (CY_DEVICE_CONFIGURATOR_IP_ENABLE_FEATURE) */
    /* } */
    block->inited = false;
}

/* -------------------------------- PDM Channel -------------------------------- */

#define MICROPY_PY_MACHINE_FOR_ALL_PDM_PCM(DO) \
    DO(0) \
    DO(1) \
    DO(2) \
    DO(3) \
    DO(4) \
    DO(5)

#define MICROPY_PY_MACHINE_PDM_PCM_NUM_ENTRIES 6

typedef struct _pdm_pcm_channel_obj_t {
    pdm_pcm_block_obj_t *block;
    uint8_t id;
    sys_int_cfg_t irq;
    mp_obj_t parent;
} pdm_pcm_channel_obj_t;

/* Forward declaration */
static void pdm_pcm_channel_irq_handler(uint8_t pdm_pcm_channel);

#define DEFINE_PDM_PCM_CHANNEL_IRQ_HANDLER(pdm_pcm_channel) \
    void PDM_PCM##pdm_pcm_channel##_Channel_IRQ_Handler(void) { \
        pdm_pcm_channel_irq_handler(pdm_pcm_channel); \
    }

MICROPY_PY_MACHINE_FOR_ALL_PDM_PCM(DEFINE_PDM_PCM_CHANNEL_IRQ_HANDLER)

#define MAP_PDM_PCM_IRQ_CONFIG(pdm_pcm_channel) \
    [pdm_pcm_channel] = { \
        &pdm_pcm_block_obj[0], \
        pdm_pcm_channel, \
        { \
            pdm_0_interrupts_##pdm_pcm_channel##_IRQn, \
            SYS_INT_IRQ_LOWEST_PRIORITY, \
            PDM_PCM##pdm_pcm_channel##_Channel_IRQ_Handler \
        }, \
        NULL, \
    },

static pdm_pcm_channel_obj_t pdm_pcm_channel_obj[MICROPY_PY_MACHINE_PDM_PCM_NUM_ENTRIES] = {
    MICROPY_PY_MACHINE_FOR_ALL_PDM_PCM(MAP_PDM_PCM_IRQ_CONFIG)
};

static pdm_pcm_channel_obj_t *pdm_pcm_channel_alloc(uint8_t channel_id, mp_obj_t parent) {
    if (pdm_pcm_channel_obj[channel_id].parent != NULL) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("PDM0 channel %u is already in use by another instance."), channel_id);
    }
    pdm_pcm_channel_obj[channel_id].parent = parent;
    return &pdm_pcm_channel_obj[channel_id];
}

static void pdm_pcm_channel_free(pdm_pcm_channel_obj_t *chan_obj) {
    if (chan_obj->id >= MICROPY_PY_MACHINE_PDM_PCM_NUM_ENTRIES) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid channel id"));
    }
    chan_obj->parent = NULL;
}

static void pdm_pcm_channel_init(pdm_pcm_channel_obj_t *chan_obj, sample_rate_t sample_rate, pdm_pcm_word_length_t word_length, bool second_channel) {
    if (!pdm_pcm_block_is_inited(chan_obj->block)) {
        pdm_pcm_block_init(chan_obj->block);
    }

    Cy_PDM_PCM_Channel_Enable(chan_obj->block->periph, chan_obj->id);

    /**
     * Configuration notes:
     * - For stereo channels, the second channel should
     *   set a sample delay. See more in the
     *   PSOC™ Edge E8x2, E8x3, E8x5, E8x6 architecture reference manual Rev. *A
     *   Section 29.3.3, page 773.
     * - TODO: Filter configuration base on sample_rate and PDM0 clock config.
     */
    cy_stc_pdm_pcm_channel_config_t channel_config = {
        .sampledelay = (second_channel) ? 5: 1,
        .wordSize = (word_length == BITS_16) ? CY_PDM_PCM_WSIZE_16_BIT : CY_PDM_PCM_WSIZE_32_BIT,
        .signExtension = true,
        .rxFifoTriggerLevel = RX_HW_FIFO_IRQ_TRIGGER_LEVEL - 1,
        .fir0_enable = false,
        .cic_decim_code = CY_PDM_PCM_CHAN_CIC_DECIM_32,
        .fir0_decim_code = CY_PDM_PCM_CHAN_FIR0_DECIM_1,
        .fir0_scale = 0,
        .fir1_decim_code = CY_PDM_PCM_CHAN_FIR1_DECIM_3,
        .fir1_scale = 10,
        .dc_block_disable = false,
        .dc_block_code = CY_PDM_PCM_CHAN_DCBLOCK_CODE_16,
    };

    cy_en_pdm_pcm_status_t ret = Cy_PDM_PCM_Channel_Init(chan_obj->block->periph, &channel_config, chan_obj->id);
    pdm_pcm_assert_raise_val("PDM PCM channel initialization failed with code: %d \r\n", ret);
}

static void pdm_pcm_channel_deinit(pdm_pcm_channel_obj_t *chan_obj) {
    Cy_PDM_PCM_Channel_DeInit(chan_obj->block->periph, chan_obj->id);
    Cy_PDM_PCM_Channel_Disable(chan_obj->block->periph, chan_obj->id);
}

static void pdm_pcm_channel_irq_init(pdm_pcm_channel_obj_t *chan_obj) {
    Cy_PDM_PCM_Channel_ClearInterrupt(chan_obj->block->periph, chan_obj->id, CY_PDM_PCM_INTR_MASK);
    Cy_PDM_PCM_Channel_SetInterruptMask(chan_obj->block->periph, chan_obj->id, CY_PDM_PCM_INTR_MASK);

    sys_int_init(&(chan_obj->irq));
}

static void pdm_pcm_channel_irq_deinit(pdm_pcm_channel_obj_t *chan_obj) {
    sys_int_deinit(&(chan_obj->irq));
    Cy_PDM_PCM_Channel_ClearInterrupt(chan_obj->block->periph, chan_obj->id, CY_PDM_PCM_INTR_MASK);
}

/* -------------------------------- PDM PCM Object -------------------------------- */

typedef struct _machine_pdm_pcm_obj_t {
    mp_obj_base_t base;
    uint8_t id;     // Private variable in this port. ID not associated to any port pin pdm-pcm group.
    mp_hal_pin_obj_t sck;
    mp_hal_pin_obj_t data;
    io_mode_t io_mode;
    format_t format;
    uint8_t bits;
    uint32_t sample_rate;
    float gain_db;
    pdm_pcm_channel_obj_t *channels[2];
    pdm_pcm_channel_obj_t *irq_channel;
    pcm_pdm_rx_fifo_ping_pong_buffer_t rx_buffer;
    ringbuf_t ring_buffer;
    mp_obj_t callback_for_non_blocking;
    non_blocking_descriptor_t non_blocking_descriptor;
} machine_pdm_pcm_obj_t;

static void pdm_pcm_read_half_rx_fifo_into_rx_buffer(machine_pdm_pcm_obj_t *self, uint32_t *rx_buf_next_frame_start_ptr) {
    for (uint32_t index = 0; index < RX_HW_FIFO_IRQ_TRIGGER_LEVEL; index++)
    {
        uint32_t data = (uint32_t)Cy_PDM_PCM_Channel_ReadFifo(self->channels[0]->block->periph, self->channels[0]->id);
        /**
         * The mono/stereo first channel uses the even indexes.
         */
        rx_buf_next_frame_start_ptr[index * 2] = data;
        if (self->format == STEREO) {
            data = Cy_PDM_PCM_Channel_ReadFifo(self->channels[1]->block->periph, self->channels[1]->id);
            /**
             * The stereo second channel uses the odd indexes.
             */
            rx_buf_next_frame_start_ptr[index * 2 + 1] = data;
        }
    }
}

static void pdm_pcm_read_into_rx_buffer(machine_pdm_pcm_obj_t *self) {
    uint32_t *rx_buf_next_frame_start_ptr = pdm_pcm_rx_buffer_get_next_frame_to_fill(&self->rx_buffer);
    pdm_pcm_read_half_rx_fifo_into_rx_buffer(self, rx_buf_next_frame_start_ptr);
}

/* -------------------------------- Ring Buffer Transfer IRQ -------------------------------- */

#define PDM_PCM_RX_FRAME_SIZE_IN_BYTES     (8)
#define PDM_PCM_SIZEOF_NON_BLOCKING_COPY_IN_BYTES    (SIZEOF_HALF_RX_BUFFER_IN_SAMPLES * PDM_PCM_RX_FRAME_SIZE_IN_BYTES)

static const int8_t pdm_pcm_frame_map[4][PDM_PCM_RX_FRAME_SIZE_IN_BYTES] = {
    { 0,  1, -1, -1, -1, -1, -1, -1 },  // Mono, 16-bits
    { 0,  1,  2,  3, -1, -1, -1, -1 },  // Mono, 32-bits
    { 0,  1, -1, -1,  2,  3, -1, -1 },  // Stereo, 16-bits
    { 0,  1,  2,  3,  4,  5,  6,  7 },  // Stereo, 32-bits
};

int8_t get_frame_mapping_index(int8_t bits, format_t format) {
    if (format == MONO) {
        if (bits == 16) {
            return 0;
        } else if (bits == 32) {
            return 1;
        }
    } else { // STEREO
        if (bits == 16) {
            return 2;
        } else if (bits == 32) {
            return 3;
        }
    }
    return -1;
}

