Infineon/micropython-psoc-edge/ports/psoc-edge/machine_pdm_pcm.c
    pdm_pcm_alloc_channels(self, self->format, &pdm_pins_config[0]);
    /** } */

    uint8_t pdm_pcm_word_length = args[ARG_bits].u_int;
    if (pdm_pcm_word_length != BITS_16 &&
        pdm_pcm_word_length != BITS_32) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid word length"));
    }
    self->bits = args[ARG_bits].u_int;

    self->gain_db = PDM_PCM_DEFAULT_GAIN_DB;
    if (args[ARG_gain].u_obj != mp_const_none) {
        self->gain_db = mp_obj_get_float(args[ARG_gain].u_obj);
    }

    self->sample_rate = args[ARG_sample_rate].u_int;
    if (self->sample_rate == 16000) {
        /**
         * TODO: Enable different sample rates
         */
    } else {
        mp_raise_ValueError(MP_ERROR_TEXT("rate not supported"));
    }

    int32_t ring_buffer_len = args[ARG_ibuf].u_int;
    if (ring_buffer_len < 0) {
        mp_raise_ValueError(MP_ERROR_TEXT("invalid ibuf"));
    }

    self->io_mode = BLOCKING;
    self->callback_for_non_blocking = MP_OBJ_NULL;

    ringbuf_alloc(&self->ring_buffer, ring_buffer_len);
    pdm_pcm_rx_buffer_init(&self->rx_buffer);
    pdm_pcm_init(self);
    pdm_pcm_set_gain(self);
    pdm_pcm_start(self);
}

static machine_pdm_pcm_obj_t *mp_machine_pdm_pcm_make_new_instance(mp_int_t pdm_pcm_id) {
    (void)pdm_pcm_id;
    machine_pdm_pcm_obj_t *self = NULL;
    for (uint8_t i = 0; i < MICROPY_PY_MACHINE_PDM_PCM_NUM_ENTRIES; i++) {
        if (MP_STATE_PORT(machine_pdm_pcm_obj[i]) == NULL) {
            self = mp_obj_malloc(machine_pdm_pcm_obj_t, &machine_pdm_pcm_type);
            MP_STATE_PORT(machine_pdm_pcm_obj[i]) = self;
            self->id = i;
            break;
        }
    }

    if (self == NULL) {
        mp_raise_ValueError(MP_ERROR_TEXT("all available PDM_PCM instances are allocated"));
    }

    return self;
}

static void mp_machine_pdm_pcm_irq_update(machine_pdm_pcm_obj_t *self) {
    /** TODO: Implementation of non-blocking  */
}

static mp_obj_t machine_pdm_pcm_gain(size_t n_args, const mp_obj_t *args) {
    machine_pdm_pcm_obj_t *self = MP_OBJ_TO_PTR(args[0]);

    if (n_args == 1) {
        return mp_obj_new_float(self->gain_db);
    } else {
        self->gain_db = pdm_pcm_get_valid_gain_db(mp_obj_get_float(args[1]));
        pdm_pcm_set_gain(self);
    }
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(machine_pdm_pcm_gain_obj, 1, 2, machine_pdm_pcm_gain);


#define MICROPY_PY_MACHINE_PDM_PDM_CLASS_EXTRAS \
    { MP_ROM_QSTR(MP_QSTR_gain),            MP_ROM_PTR(&machine_pdm_pcm_gain_obj) }, \


static void mp_machine_pdm_pcm_deinit(machine_pdm_pcm_obj_t *self) {
    pdm_pcm_stop(self);
    pdm_pcm_channel_irq_deinit(self->irq_channel);
    pdm_pcm_channel_deinit(self->channels[0]);
    pdm_pcm_channel_free(self->channels[0]);
    if (self->format == STEREO) {
        pdm_pcm_channel_deinit(self->channels[1]);
        pdm_pcm_channel_free(self->channels[1]);
    }
    MP_STATE_PORT(machine_pdm_pcm_obj[self->id]) = NULL;

    /* Deinit the block if no other instances are using it */
    for (uint8_t i = 0; i < MICROPY_PY_MACHINE_PDM_PCM_NUM_ENTRIES; i++) {
        if (MP_STATE_PORT(machine_pdm_pcm_obj[i]) != NULL) {
            return;
        }
    }
    pdm_pcm_block_deinit(self->channels[0]->block);
}

void machine_pdm_pcm_deinit_all(void) {
    for (uint8_t i = 0; i < MICROPY_PY_MACHINE_PDM_PCM_NUM_ENTRIES; i++) {
        machine_pdm_pcm_obj_t *pdm_pcm_obj = MP_STATE_PORT(machine_pdm_pcm_obj[i]);
        if (pdm_pcm_obj != NULL) {
            mp_machine_pdm_pcm_deinit(pdm_pcm_obj);
        }
    }
}

MP_REGISTER_ROOT_POINTER(struct _machine_pdm_pcm_obj_t *machine_pdm_pcm_obj[MICROPY_PY_MACHINE_PDM_PCM_NUM_ENTRIES]);
